grevaillot/svd_tools/headers/STM32G484xx/tim5.h
/** TIM5_BDTR_MOE Main output enable **/
#define TIM5_BDTR_MOE		(1 << 15)
/** TIM5_BDTR_AOE Automatic output enable **/
#define TIM5_BDTR_AOE		(1 << 14)
/** TIM5_BDTR_BKP Break polarity **/
#define TIM5_BDTR_BKP		(1 << 13)
/** TIM5_BDTR_BKE Break enable **/
#define TIM5_BDTR_BKE		(1 << 12)
/** TIM5_BDTR_OSSR Off-state selection for Run mode **/
#define TIM5_BDTR_OSSR		(1 << 11)
/** TIM5_BDTR_OSSI Off-state selection for Idle mode **/
#define TIM5_BDTR_OSSI		(1 << 10)

#define TIM5_BDTR_LOCK_SHIFT		8
#define TIM5_BDTR_LOCK_MASK		0x03
/** @defgroup tim5_bdtr_lock LOCK Lock configuration
@{*/
/**@}*/


#define TIM5_BDTR_DTG_SHIFT		0
#define TIM5_BDTR_DTG_MASK		0xff
/** @defgroup tim5_bdtr_dtg DTG Dead-time generator setup
@{*/
/**@}*/


/**@}*/

/** @defgroup tim5_ccr5 CCR5 capture/compare register 4
@{*/

/** TIM5_CCR5_GC5C3 Group Channel 5 and Channel 3 **/
#define TIM5_CCR5_GC5C3		(1 << 31)
/** TIM5_CCR5_GC5C2 Group Channel 5 and Channel 2 **/
#define TIM5_CCR5_GC5C2		(1 << 30)
/** TIM5_CCR5_GC5C1 Group Channel 5 and Channel 1 **/
#define TIM5_CCR5_GC5C1		(1 << 29)

#define TIM5_CCR5_CCR5_SHIFT		0
#define TIM5_CCR5_CCR5_MASK		0xffff
/** @defgroup tim5_ccr5_ccr5 CCR5 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim5_ccr6 CCR6 capture/compare register 4
@{*/


#define TIM5_CCR6_CCR6_SHIFT		0
#define TIM5_CCR6_CCR6_MASK		0xffff
/** @defgroup tim5_ccr6_ccr6 CCR6 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim5_ccmr3_output CCMR3Output capture/compare mode register 2 (output mode)
@{*/

/** TIM5_CCMR3_Output_OC6M_bit3 Output Compare 6 mode bit 3 **/
#define TIM5_CCMR3_Output_OC6M_bit3		(1 << 24)

#define TIM5_CCMR3_Output_OC5M_bit3_SHIFT		16
#define TIM5_CCMR3_Output_OC5M_bit3_MASK		0x07
/** @defgroup tim5_ccmr3_output_oc5m_bit3 OC5Mbit3 Output Compare 5 mode bit 3
@{*/
/**@}*/

/** TIM5_CCMR3_Output_OC6CE Output compare 6 clear enable **/
#define TIM5_CCMR3_Output_OC6CE		(1 << 15)

#define TIM5_CCMR3_Output_OC6M_SHIFT		12
#define TIM5_CCMR3_Output_OC6M_MASK		0x07
/** @defgroup tim5_ccmr3_output_oc6m OC6M Output compare 6 mode
@{*/
/**@}*/

/** TIM5_CCMR3_Output_OC6PE Output compare 6 preload enable **/
#define TIM5_CCMR3_Output_OC6PE		(1 << 11)
/** TIM5_CCMR3_Output_OC6FE Output compare 6 fast enable **/
#define TIM5_CCMR3_Output_OC6FE		(1 << 10)
/** TIM5_CCMR3_Output_OC5CE Output compare 5 clear enable **/
#define TIM5_CCMR3_Output_OC5CE		(1 << 7)

#define TIM5_CCMR3_Output_OC5M_SHIFT		4
#define TIM5_CCMR3_Output_OC5M_MASK		0x07
/** @defgroup tim5_ccmr3_output_oc5m OC5M Output compare 5 mode
@{*/
/**@}*/

/** TIM5_CCMR3_Output_OC5PE Output compare 5 preload enable **/
#define TIM5_CCMR3_Output_OC5PE		(1 << 3)
/** TIM5_CCMR3_Output_OC5FE Output compare 5 fast enable **/
#define TIM5_CCMR3_Output_OC5FE		(1 << 2)

/**@}*/

/** @defgroup tim5_dtr2 DTR2 timer Deadtime Register 2
@{*/

/** TIM5_DTR2_DTPE Deadtime Preload Enable **/
#define TIM5_DTR2_DTPE		(1 << 17)
/** TIM5_DTR2_DTAE Deadtime Asymmetric Enable **/
#define TIM5_DTR2_DTAE		(1 << 16)

#define TIM5_DTR2_DTGF_SHIFT		0
#define TIM5_DTR2_DTGF_MASK		0xff
/** @defgroup tim5_dtr2_dtgf DTGF Dead-time falling edge generator setup
@{*/
/**@}*/


/**@}*/

/** @defgroup tim5_ecr ECR DMA control register
@{*/


#define TIM5_ECR_PWPRSC_SHIFT		24
#define TIM5_ECR_PWPRSC_MASK		0x07
/** @defgroup tim5_ecr_pwprsc PWPRSC Pulse Width prescaler
@{*/
/**@}*/


#define TIM5_ECR_PW_SHIFT		16
#define TIM5_ECR_PW_MASK		0xff
/** @defgroup tim5_ecr_pw PW Pulse width
@{*/
/**@}*/


#define TIM5_ECR_IPOS_SHIFT		6
#define TIM5_ECR_IPOS_MASK		0x03
/** @defgroup tim5_ecr_ipos IPOS Index Positioning
@{*/
/**@}*/

/** TIM5_ECR_FIDX First Index **/
#define TIM5_ECR_FIDX		(1 << 5)

#define TIM5_ECR_IBLK_SHIFT		3
#define TIM5_ECR_IBLK_MASK		0x03
/** @defgroup tim5_ecr_iblk IBLK Index Blanking
@{*/
/**@}*/


#define TIM5_ECR_IDIR_SHIFT		1
#define TIM5_ECR_IDIR_MASK		0x03
/** @defgroup tim5_ecr_idir IDIR Index Direction
@{*/
/**@}*/

/** TIM5_ECR_IE Index Enable **/
#define TIM5_ECR_IE		(1 << 0)

/**@}*/

/** @defgroup tim5_tisel TISEL TIM timer input selection register
@{*/


#define TIM5_TISEL_TI4SEL_SHIFT		24
#define TIM5_TISEL_TI4SEL_MASK		0x0f
/** @defgroup tim5_tisel_ti4sel TI4SEL TI4[0] to TI4[15] input selection
@{*/
/**@}*/


#define TIM5_TISEL_TI3SEL_SHIFT		16
#define TIM5_TISEL_TI3SEL_MASK		0x0f
/** @defgroup tim5_tisel_ti3sel TI3SEL TI3[0] to TI3[15] input selection
@{*/
/**@}*/


#define TIM5_TISEL_TI2SEL_SHIFT		8
#define TIM5_TISEL_TI2SEL_MASK		0x0f
/** @defgroup tim5_tisel_ti2sel TI2SEL TI2[0] to TI2[15] input selection
@{*/
/**@}*/


#define TIM5_TISEL_TI1SEL_SHIFT		0
#define TIM5_TISEL_TI1SEL_MASK		0x0f
/** @defgroup tim5_tisel_ti1sel TI1SEL TI1[0] to TI1[15] input selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tim5_af1 AF1 TIM alternate function option register 1
@{*/


#define TIM5_AF1_ETRSEL_SHIFT		14
#define TIM5_AF1_ETRSEL_MASK		0x0f
/** @defgroup tim5_af1_etrsel ETRSEL ETR source selection
@{*/
/**@}*/

/** TIM5_AF1_BKCMP4P BRK COMP4 input polarity **/
#define TIM5_AF1_BKCMP4P		(1 << 13)
/** TIM5_AF1_BKCMP3P BRK COMP3 input polarity **/
#define TIM5_AF1_BKCMP3P		(1 << 12)
/** TIM5_AF1_BKCMP2P BRK COMP2 input polarity **/
#define TIM5_AF1_BKCMP2P		(1 << 11)
/** TIM5_AF1_BKCMP1P BRK COMP1 input polarity **/
#define TIM5_AF1_BKCMP1P		(1 << 10)
/** TIM5_AF1_BKINP BRK BKIN input polarity **/
#define TIM5_AF1_BKINP		(1 << 9)
/** TIM5_AF1_BKCMP7E BRK COMP7 enable **/
#define TIM5_AF1_BKCMP7E		(1 << 7)
/** TIM5_AF1_BKCMP6E BRK COMP6 enable **/
#define TIM5_AF1_BKCMP6E		(1 << 6)
/** TIM5_AF1_BKCMP5E BRK COMP5 enable **/
#define TIM5_AF1_BKCMP5E		(1 << 5)
/** TIM5_AF1_BKCMP4E BRK COMP4 enable **/
#define TIM5_AF1_BKCMP4E		(1 << 4)
/** TIM5_AF1_BKCMP3E BRK COMP3 enable **/
#define TIM5_AF1_BKCMP3E		(1 << 3)
/** TIM5_AF1_BKCMP2E BRK COMP2 enable **/
#define TIM5_AF1_BKCMP2E		(1 << 2)
/** TIM5_AF1_BKCMP1E BRK COMP1 enable **/
#define TIM5_AF1_BKCMP1E		(1 << 1)
/** TIM5_AF1_BKINE BRK BKIN input enable **/
#define TIM5_AF1_BKINE		(1 << 0)

/**@}*/

/** @defgroup tim5_af2 AF2 TIM alternate function option register 2
@{*/


#define TIM5_AF2_OCRSEL_SHIFT		16
#define TIM5_AF2_OCRSEL_MASK		0x07
/** @defgroup tim5_af2_ocrsel OCRSEL OCREF_CLR source selection
@{*/
/**@}*/

/** TIM5_AF2_BK2CMP4P BRK2 COMP4 input polarity **/
#define TIM5_AF2_BK2CMP4P		(1 << 13)
/** TIM5_AF2_BK2CMP3P BRK2 COMP3 input polarity **/
#define TIM5_AF2_BK2CMP3P		(1 << 12)
/** TIM5_AF2_BK2CMP2P BRK2 COMP2 input polarity **/
#define TIM5_AF2_BK2CMP2P		(1 << 11)
/** TIM5_AF2_BK2CMP1P BRK2 COMP1 input polarity **/
#define TIM5_AF2_BK2CMP1P		(1 << 10)
/** TIM5_AF2_BK2INP BRK2 BKIN input polarity **/
#define TIM5_AF2_BK2INP		(1 << 9)
/** TIM5_AF2_BK2CMP7E BRK2 COMP7 enable **/
#define TIM5_AF2_BK2CMP7E		(1 << 7)
/** TIM5_AF2_BK2CMP6E BRK2 COMP6 enable **/
#define TIM5_AF2_BK2CMP6E		(1 << 6)
/** TIM5_AF2_BK2CMP5E BRK2 COMP5 enable **/
#define TIM5_AF2_BK2CMP5E		(1 << 5)
/** TIM5_AF2_BK2CMP4E BRK2 COMP4 enable **/
#define TIM5_AF2_BK2CMP4E		(1 << 4)
/** TIM5_AF2_BK2CMP3E BRK2 COMP3 enable **/
#define TIM5_AF2_BK2CMP3E		(1 << 3)
/** TIM5_AF2_BK2CMP2E BRK2 COMP2 enable **/
#define TIM5_AF2_BK2CMP2E		(1 << 2)
/** TIM5_AF2_BK2CMP1E BRK2 COMP1 enable **/
#define TIM5_AF2_BK2CMP1E		(1 << 1)
/** TIM5_AF2_BKINE BRK BKIN input enable **/
#define TIM5_AF2_BKINE		(1 << 0)

/**@}*/

/** @defgroup tim5_dcr DCR control register
@{*/


#define TIM5_DCR_DBL_SHIFT		8
#define TIM5_DCR_DBL_MASK		0x1f
/** @defgroup tim5_dcr_dbl DBL DMA burst length
@{*/
/**@}*/


#define TIM5_DCR_DBA_SHIFT		0
#define TIM5_DCR_DBA_MASK		0x1f
/** @defgroup tim5_dcr_dba DBA DMA base address
@{*/
/**@}*/


/**@}*/

/** @defgroup tim5_dmar DMAR DMA address for full transfer
@{*/


#define TIM5_DMAR_DMAB_SHIFT		0
#define TIM5_DMAR_DMAB_MASK		0xffffffff
/** @defgroup tim5_dmar_dmab DMAB DMA register for burst accesses
@{*/
/**@}*/


/**@}*/
